[{
    "id": "1",
    "category": "Science",
    "title": "Shravan, Manan, and Nididhyasana in Vedanta Philosophy",
    "description": "Three stages of learning in Vedanta philosophy",
    "description2": "Vedanta philosophy emphasizes Shravan, Manan, and Nididhyasana—a three-step journey to self-realization. Shravan (deep listening) involves absorbing teachings from a guru. Manan (contemplation) is reflecting on and internalizing these truths. Nididhyasana (meditation) leads to direct experience. Despite challenges like distractions, this practice purifies the mind, fosters wisdom, and ultimately leads to liberation.",
    "imageUrl": "https://i.postimg.cc/90LSD4MC/PHOTO-2025-02-03-15-19-17.jpg",
    "imageUrl2": "image60-detail.jpeg",
    "longarticle": [
      {
        "subtitle": "comingsoon",
        "content": "comingsoon"  
      }
    ]
  },
  {
    "id": "2",
    "category": "International",
    "title": "The Forgotten Genocide: The Great Calcutta Killings of 1946", 
    "description": "Direct Action Day and its aftermath",
    "description2": "On August 16, 1946, the Muslim League’s Direct Action Day unleashed terror in Kolkata, with armed mobs killing thousands of Hindus, burning homes, and raping women under state-backed protection. The violence spilled into the Noakhali Genocide, displacing entire Hindu communities. These atrocities set the stage for India’s Partition, leaving scars of communal hatred that linger to this day.",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/8/87/Calcutta_1946_riot.jpg",
    "imageUrl2": "card1-detail.png",
    "longarticle": [
      {
        "subtitle": "comingsoon",
        "content": "comingsoon"
      }
    ]
  },
  {
    "id": "3", 
    "category": "Indian",
    "title": "Bappa Rawal: Guardian of Mewar's Legacy",
    "description": "Founder of the Sisodia dynasty", 
    "description2": "Bappa Rawal (713–753 CE) was the founder of the Sisodia dynasty in Mewar, Rajasthan. He is celebrated for repelling Arab invasions and establishing the Sisodia rule in Chittor, which became a stronghold of Rajput resistance. A devotee of Lord Shiva, Bappa Rawal revitalized Hindu traditions and played a crucial role in shaping Rajput identity. His legacy is marked by valor and devotion, making him a significant figure in Indian history.",
    "imageUrl": "https://organiser.org/wp-content/uploads/2023/08/bappa-rawal.jpeg",
    "imageUrl2": "bappa-detail.png",
    "longarticle": [
      {
        "subtitle": "🛡️ Name and Legacy:",
        "content": "Known as Bappa Rawal, born Kalbhoj, he established the Sisodia dynasty of Mewar, which became synonymous with valor, resistance, and cultural preservation."
      },
      {
        "subtitle": "📜 Historical Significance:",
        "content": "His reign not only marked the start of the Mewar kingdom’s golden era but also laid the foundation for its glorious heritage. The Sisodia dynasty produced iconic figures like Maharana Pratap and resisted foreign invasions for centuries."
      },
      {
        "subtitle": "👶 Early Life and Lineage\n👑 Birth and Family:",
        "content": "Born in 713 CE, Bappa Rawal belonged to the Guhilot clan, a Rajput lineage known for its royal status in Rajasthan. ⚜️ His father, Mahendra II, was a ruler in the Guhilot dynasty, making Bappa heir to a prestigious royal lineage.\n\n📍 Cultural Context: The Guhilot dynasty was deeply tied to Rajasthan’s traditions and Hindu culture, ensuring that Bappa grew up in an environment steeped in valor, faith, and leadership values."
      },
      {
        "subtitle": "🗡️ Ascension to Power:",
        "content": "⚔️ Defeating the Mori Dynasty: Bappa Rawal gained prominence by overthrowing the Mori dynasty, which ruled the Chittor region. 🏯 The Moris controlled Chittor Fort—a critical stronghold—but their weakening grip on power allowed Bappa Rawal to capture the region and claim leadership.\n\n🏆 Key Achievement: This marked the beginning of the Sisodia dynasty’s dominance in Mewar and cemented Bappa’s role as a powerful Rajput leader."
      },
      {
        "subtitle": "🌍 Protecting India from Arab Invasions:",
        "content": "🏴‍☠️ Arab Threats: During the 8th century, the Umayyad Caliphate, led by Muhammad bin Qasim, had successfully conquered Sindh and was advancing into Rajasthan and central India. 🌐 This posed a significant threat to the Indian heartland and its Hindu cultural fabric.\n\n🛡️ Bappa Rawal’s Victory: Bappa is celebrated for his heroic defense against Arab forces, preventing their eastward expansion. His strategic warfare and alliances ensured that Mewar remained independent, safeguarding India’s culture and autonomy during a turbulent era. This victory was critical in preserving Rajasthan’s political independence and its religious traditions, making Bappa a symbol of Rajput resilience."
      },
      {
        "subtitle": "🏰 Capture of Chittor Fort",
        "content": "🏯 Chittor Fort’s Importance: Chittor became the capital of Mewar under Bappa Rawal and a symbol of Rajputana’s resistance and pride.\n\n🛕 Spiritual and Strategic Significance: The fort was not just a military stronghold but also a cultural and spiritual beacon for Mewar. Its impregnable walls and elevation provided unmatched defense, and its control was essential to dominate Rajputana.\n\n⚡ Legacy: Chittor Fort remained a rallying point for Rajput resistance, especially during the Mughal invasions of later centuries."
      },
      {
        "subtitle": "🤝 Strategic Alliances and Military Campaigns",
        "content": "🤝 Forging Alliances: Bappa Rawal strategically allied with neighboring Rajput rulers and regional kingdoms, strengthening Mewar’s defensive and offensive capabilities. These alliances created a united front against foreign invaders, ensuring the stability of his kingdom.\n\n⚔️ Expanding Mewar’s Borders: Through military campaigns and tactical diplomacy, Bappa Rawal incorporated smaller kingdoms into Mewar. 🛡️ He established a buffer zone, shielding Mewar from potential external invasions, particularly from Arab forces. 💪 Tactical Brilliance: His ability to balance diplomacy and warfare allowed Mewar to thrive despite external threats, setting a precedent for future Rajput rulers."
      },
      {
        "subtitle": "🕉️ Religious Legacy:",
        "content": "🛕 Reviving Hinduism: At a time when external invasions threatened India’s religious fabric, Bappa Rawal was a staunch proponent of Shaivism (devotion to Lord Shiva). He played a pivotal role in rejuvenating Vedic practices and temple patronage, helping preserve Hindu traditions.\n\n🙏 Eklingji Temple: Bappa Rawal founded the Eklingji Temple near Udaipur, dedicated to Lord Shiva. ✨ The Sisodia dynasty considered themselves servants (“Diwans”) of Eklingji, reinforcing the belief that Lord Shiva was the true ruler of Mewar. The temple became the spiritual heart of Mewar and a testament to Bappa’s religious devotion."
      },
      {
        "subtitle": "🌟 Legacy of Bappa Rawal:",
        "content": "🏆 Rajput Ideals: Bappa Rawal’s life and reign epitomized the Rajput virtues of bravery, honor, and devotion to culture and religion. 💡 Dynastic Impact: He laid the foundation for the Sisodia dynasty, which went on to inspire generations of Rajput rulers with its resilience against invaders, including the Mughals. 🌟 Enduring Symbol: Today, Bappa Rawal is remembered as a warrior-king, a religious reformer, and a defender of Indian autonomy and culture."
      }
    ]
  },
  {
    "id": "4",
    "category": "Indian",
    "title": "Rajshree Birla: Empowering & Inspiring Generations",
    "description": "Padma Bhushan recipient and philanthropist",
    "description2": "Rajshree Birla is an Indian philanthropist. Rajashree Birla received the Padma Bhushan in 2011 for her exceptional contributions to socia work and philanthropy. As the chairperson of the Aditya Birla Centre for Community Initiatives and Rural Development, she has been instrumental in steering a wide range of social welfare projects. Her efforts have primarily focused on sectors such as education, healthcare,women’s empowerment, rural infrastructure & sanitation.",
    "imageUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT02wmYcTJPSbHxKhaKbbgUT9rq-n6caJ3wTA&s",
    "imageUrl2": "card2-detail.png",
    "longarticle": [
      {
        "subtitle": "Early Life",
        "content": "Born: In 1948 in Madurai, Tamil Nadu, India. Heritage: Rajashree’s family hailed from Rajasthan, belonging to the Marwari Vaishya community, specifically the Maheshwari sub-caste. Family: Her father, Radhakishen Fomra, was a dealer for Burmah Shell, while her mother, Parvati Devi Fomra, was a homemaker. Education: Rajashree studied at St. Joseph’s Convent School in Madurai."
      },
      {
        "subtitle": "Philanthropic Work",
        "content": "Once her children were grown, Rajashree Birla turned her focus to social work and charity. She leads the Aditya Birla Centre for Community Initiatives and Rural Development—the CSR arm of the Aditya Birla Group—making significant contributions to society through various initiatives."
      },
      {
        "subtitle": "Values and Influence",
        "content": "Rajashree credits Mahatma Gandhi’s principles and the teachings of the Bhagavad Gita for shaping her values. Her guiding philosophy is the phrase, “This too will pass,” which has helped her navigate life’s challenges with grace."
      },
      {
        "subtitle": "Personal Life",
        "content": "Rajashree resides in South Mumbai with her son Kumar Mangalam Birla and his family. Despite her wealth and status, she maintains a humble, understated middle-class lifestyle that reflects her values of simplicity."
      },
      {
        "subtitle": "Contributions to Healthcare Initiatives",
        "content": "Healthcare Access: Leading efforts to provide quality healthcare services in underserved regions. Rural Development: Empowering rural communities through better medical facilities and healthcare awareness. Hospitals and Medical Facilities: Supporting the establishment and modernization of hospitals, clinics, and healthcare centers across India to ensure quality medical care for those with limited access. Medical Camps and Services: Organizing free medical camps offering check-ups, surgeries, and treatments, and deploying mobile medical vans to bring essential healthcare services to remote areas. Research and Development: Contributing to medical research and supporting initiatives aimed at combating diseases like cancer while promoting healthcare innovations. These efforts help bridge the healthcare gap between urban and rural areas, ensuring that vulnerable populations receive the care they need."
      }
    ]
  },
  {
    "id": "5", 
    "category": "Metallurgy",
    "title": "Wootz Steel – A Marvel of Ancient Metallurgy",
    "description": "Ancient Indian steel innovation",
    "description2": "Wootz steel, an ancient Indian innovation, was a marvel of metallurgy. Known for its intricate patterns and unmatched strength, this high-carbon steel originated in Southern India around the mid-1st millennium BCE. Exported globally, it inspired the legendary Damascus steel. Crafted using unique methods like crucible carburization and monsoon-driven wind furnaces, Wootz steel shaped swords revered for their sharpness and resilience.",
    "imageUrl": "https://preview.redd.it/wootz-steel-making-process-v0-duhz1jq6wgsa1.jpg?width=640&crop=smart&auto=webp&s=352d4cba95d20e599853c19a4451624392ce05ae",
    "imageUrl2": "card4-detail.png",
    "longarticle": [
      {
        "subtitle": "comingsoon",
        "content": "comingsoon"
      }
    ]
  },
  {
    "id": "6",
    "category": "Metallurgy",
    "title": "The Rustless Wonder: A Timeless Testament to Indian Ingenuity",
    "description": "The Iron Pillar of Delhi",
    "description2": "In the Qutub Minar complex stands a 7.21-meter iron pillar from the Gupta era (4th–5th century CE), honoring Vishnu and King Chandragupta II’s victories. Made of 98% pure iron, it remains rust-free for centuries, thanks to a protective misawite oxide layer and ideal conditions, making it a remarkable scientific and historical marvel.",
    "imageUrl": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgQCUI7b6WPohoHVTkVv5FJGZZeLft0pCCzwaO4pURupdRSy7Cna_ydHYDJErPWQiigxyY5MHV_c5SuYXo7e13I16l2pmJlUkruM296YmHYLjQLeN7bjqReDrvzJ1knY-3bXiGYdggiL04d/s1600/Delhi_Iron_pillar.JPG",
    "imageUrl2": "card5-detail.png", 
    "longarticle": [
      {
        "subtitle": "comingsoon",
        "content": "comingsoon"
      }
    ]
  },
  {
    "id": "7",
    "category": "Science",
    "title": "Tracing the Roots: Ancient Indian Mathematics",
    "description": "Revolutionary mathematical concepts",
    "description2": "Did You Know? Ancient India was the birthplace of revolutionary mathematical concepts that shaped the modern world. From the invention of zero to the decimal system, and from early trigonometric functions to the development of infinite series, India’s mathematical heritage is vast and profound. These innovations didn’t just stay within India’s borders but traveled across the world, miscredited as “Arabic numerals,” shaping global mathematics and influencing numerous fields.",
    "imageUrl": "https://madrascourier.com/wp-content/uploads/2020/02/Bakhshali-Manuscript-Madras-Courier-01.jpg",
    "imageUrl2": "card6-detail.png",
    "longarticle": [
      {
        "subtitle": "comingsoon",
        "content": "comingsoon"
      }
    ]
  },
  {
    "id": "8",
    "category": "Technology",
    "title": "Navigating Ancient India: Maritime Legacy",
    "description": "Ancient Indian maritime technologies",
    "description2": "Ancient India’s shipbuilding prowess was unmatched, with advanced techniques documented in texts like Yukti Kalpa Taru. Indian mariners developed specialized ships for trade, warfare, and royal transport, alongside the invention of the Maccha Yantra—an early compass. With colonies from Cambodia to Japan, India’s maritime legacy shaped world trade and exploration, revealing the untold secrets of this ancient maritime empire.",
    "imageUrl": "https://maritimeindia.org/wp-content/uploads/2023/01/Indias-Maritime-Identity.png", 
    "imageUrl2": "card7-detail.png",
    "longarticle": [
      {
        "subtitle": "comingsoon",
        "content": "comingsoon"
      }
    ]
  }, {
    "id": "9",
    "category": "Technology",
    "title": "Oral Tradition: Preserving Wisdom Through Generations",
    "description": "Ancient knowledge transmission system",
    "description2": "In ancient India, the oral tradition was a deeply ingrained practice, shaping the transmission of wisdom across generations. Knowledge, ranging from spiritual teachings to practical skills, was orally shared, creating a rich cultural heritage. This tradition encompassed stories, scriptures, epics, proverbs, and customs, which were constantly evolving. Guru-disciple relationships were central to this tradition, ensuring the preservation and dissemination of profound insights.",
    "imageUrl": "https://www.afriklens.com/wp-content/uploads/2024/11/DALL%C2%B7E-2024-11-07-06.39.26-A-vibrant-detailed-horizontal-image-illustrating-African-oral-traditions.-In-the-scene-an-elder-storyteller-sits-under-a-large-ancient-tree-surrou.webp",
    "imageUrl2": "card9-detail.png",
    "longarticle": [
      {
        "subtitle": "comingsoon",
        "content": "comingsoon"
      }
    ]
  },
  {
    "id": "10",
    "category": "Indian",
    "title": "Mystical World of Natya Shastra",
    "description": "Ancient treatise on performing arts",
    "description2": "Step into the mystical world of Natya Shastra, where ancient wisdom brings drama, dance, and music to life. This 2000-year-old masterpiece doesn’t just decode emotions (Rasa)—it perfects every expression (Abhinaya) and designs the cosmic stage of existence. Still fueling modern storytelling and spiritual journeys, its influence is timeless. Ready to uncover the secrets of this divine art? Dive in now!",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Shiva_as_the_Lord_of_Dance_LACMA_edit.jpg/1200px-Shiva_as_the_Lord_of_Dance_LACMA_edit.jpg",
    "imageUrl2": "card10-detail.png",
    "longarticle": [
      {
        "subtitle": "comingsoon",
        "content": "comingsoon"
      }
    ]
  },
  {
    "id": "11",
    "category": "Indian",
    "title": "Kautilyan Niti: Wisdom in India's Modern Foreign Relations",
    "description": "Ancient diplomatic principles",
    "description2": "Kautilya’s timeless wisdom shapes India’s modern diplomacy. His Mandal Siddhant views neighbors as inherent rivals, while the Shadgunya Siddhant offers six dynamic strategies—ranging from treaties to dual alliances—to navigate these rivalries. India’s foreign policy mirrors this brilliance, balancing relations with Pakistan and China, and leveraging partnerships like the Quad in the Indo-Pacific to counter challenges. It’s a masterclass in blending ancient strategy with modern geopolitics.",
    "imageUrl": "https://aseemamag.com/wp-content/uploads/2021/04/unnamed.jpg",
    "imageUrl2": "card12-detail.png",
    "longarticle": [
      {
        "subtitle": "comingsoon",
        "content": "comingsoon"
      }
    ]
  },
  {
    "id": "12",
    "category": "Technology",
    "title": "Bridging Earth and Sky: Mystical Architecture of Sthapatya Shastra",
    "description": "Ancient architectural science",
    "description2": "Sthapatya Shastra is an ancient Indian science of architecture, blending art, science, and spirituality to create spaces embodying cosmic order. Originating from the Indus Valley Civilization, it influenced architecture across Asia and beyond, from majestic temples to grand stupas. Today, its principles continue to inspire modern architecture, emphasizing harmony with nature and the cosmos..",
    "imageUrl": "https://www.indiadivine.org/wp-content/uploads/2015/08/madurai-19.jpg",
    "imageUrl2": "card13-detail.png",
    "longarticle": [
      {
        "subtitle": "comingsoon",
        "content": "comingsoon"
      }
    ]
  },
  {
    "id": "13",
    "category": "Astronomy",
    "title": "Unveiling India's Forgotten Astronomical Legacy",
    "description": "Ancient astronomical achievements",
    "description2": "Ancient India’s shipbuilding prowess was unmatched, with advanced techniques documented in texts like Yukti Kalpa Taru. Indian mariners developed specialized ships for trade, warfare, and royal transport, alongside the invention of the Maccha Yantra—an early compass. With colonies from Cambodia to Japan, India’s maritime legacy shaped world trade and exploration, revealing the untold secrets of this ancient maritime empire.",
    "imageUrl": "https://theindosphere.com/wp-content/uploads/2024/05/DALL%C2%B7E-2024-08-31-13.14.35-A-richly-detailed-illustration-of-an-ancient-Indian-astrological-scene.-The-background-features-a-starry-night-sky-with-visible-constellations-remini.webp",
    "imageUrl2": "card14-detail.png",
    "longarticle": [
      {
        "subtitle": "comingsoon",
        "content": "comingsoon"
      }
    ]
  },
  {
    "id": "14",
    "category": "Indian",
    "title": "Whispers of Eternity: Kashi – Where Life and Death Dance Together",
    "description": "Sacred city of Varanasi",
    "description2": "Kashi, or Varanasi, is a 3,000-year-old sacred city where life and death coexist. The Ganges flows through it, symbolizing spiritual liberation. Believed to be founded by Lord Shiva, Kashi is a Hindu pilgrimage site for Moksha seekers. Its ancient temples, rituals, and ghats, especially Manikarnika Ghat, embody deep spiritual heritage. The city’s vibrant culture, timeless traditions, and mystical aura make it a revered spiritual hub.",
    "imageUrl": "https://www.savaari.com/blog/wp-content/uploads/2023/09/Varanasi_ghats1.webp",
    "imageUrl2": "card15-detail.png",
    "longarticle": [
      {
        "subtitle": "comingsoon",
        "content": "comingsoon"
      }
    ]
  },
  {
    "id": "15",
    "category": "International",
    "title": "The Last War of Indepencence : The Naval Mutiny",
    "description": "Royal Indian Navy Mutiny of 1946",
    "description2": "India’s independence wasn’t achieved solely through non-violence. The 1946 Royal Indian Navy Mutiny played a crucial role, with 70,000 sailors revolting against British rule, inspired by Subhas Chandra Bose. This military uprising exposed British vulnerabilities and marked a major challenge to colonial rule. More than just grievances, it was a bold defiance that accelerated India’s path to freedom.",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/e/e6/RIN_HMIS_Hindustan.jpg",
    "imageUrl2": "card16-detail.png",
    "longarticle": [
      {
        "subtitle": "comingsoon",
        "content": "comingsoon"
    }
]
}
]